Repository: andhrelja/django-videos
Catalog: static/locale/*/LC_MESSAGES/django.po
Languages: hr

source: User type
hr: Tip korisnika

source: Error:
hr: Greška:

source: Django Videos
hr: Django Videa

source: Browse Videos
hr: Pregled videa

source: Upload Video
hr: Upload videa

source: Are you sure you want to delete video this video?
hr: Jeste li sigurni da želite obrisati ovaj video?

source: Yes
hr: Da

source: No
hr: Ne

source: Created at
hr: Datum stvaranja

source: Edit
hr: Ažuriraj

source: Save Video
hr: Spremi video

source: Cancel
hr: Odustani

source: Elementary School
hr: Osnovna škola

source: High School
hr: Srednja škola

source: 1st year
hr: 1. razred

source: 2nd year
hr: 2. razred

source: 3rd year
hr: 3. razred

source: 4th year
hr: 4. razred

source: 5th year
hr: 5. razred

source: 6th year
hr: 6. razred

source: 7th year
hr: 7. razred

source: 8th year
hr: 8. razred

source: Name
hr: Naziv

source: Description
hr: Opis

source: Ratings
hr: Ocjene

source: Scholar Seniority
hr: Razina školovanja

source: Class
hr: Razred

source: Created at
hr: Datum stvaranja

source: Updated at
hr: Datum ažuriranja

source: Created by
hr: Vlasnik

source: Videos
hr: Videa
